
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_storage_blob.b2c_login_css


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_login_css must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_css" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "f9883e1455fbb50d4737b194909ee05f" -> "98f1677b55b392d7b5b308461ca70d82" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":719,"Program":"tfcmt","SHA1":"","Vars":{}} -->